export default function PrivacyZhPage() {
  return (
    <div className="prose prose-sm sm:prose-base lg:prose-lg xl:prose-2xl m-auto p-4 sm:p-6 lg:p-8 w-4/5">
      <h1 className="text-2xl text-center font-bold my-4">隐私政策</h1>
      <div className="flex flex-col gap-2 my-4 text-center">
        <p className="text-sm text-gray-500">
          <strong>最后更新:</strong> 2025年6月15日
        </p>
        <p className="text-sm text-gray-500">
          <strong>生效日期:</strong> 2025年5月22日
        </p>
      </div>
      <div className="flex flex-col gap-2 my-4">
        <p>
          <strong>特铱铂智能科技（上海）有限公司</strong>
          （以下简称"我们"）制定本隐私政策，旨在说明当您使用我们通过
          <strong className="text-primary"> www.iturboai.com </strong>
          提供的软件即服务（SaaS）产品时，我们如何收集、使用、披露和保护您的信息。这些服务包括相关的软件、应用程序和网站（统称为"服务"）。
        </p>
        <p>
          使用我们的服务即表示您已阅读并同意本隐私政策的所有条款。若您不同意此等条款，请立即停止使用或访问我们的应用程序。我们强烈建议您在采取任何行动前，详细阅读本政策。
        </p>
        <p>
          为优化您的用户体验，我们需要处理您的个人信息。若您不希望我们按本政策所述方式处理您的个人信息，或您未满18周岁，请停止使用我们的服务。
        </p>
        <p>我们收集和使用您的信息主要用于：</p>
        <ul className="list-disc list-inside pl-4 gap-2">
          <li>提供和改进我们的服务及用户体验</li>
          <li>确保平台的安全性和完整性</li>
          <li>履行我们的法律义务</li>
        </ul>
        <p>
          必要时，我们会与可信的第三方和服务提供商共享您的信息，以提供服务、满足法律要求，并实现本政策后续详述的其他目的。
        </p>

        <h2 className="text-lg font-bold my-2">1. 我们收集的信息</h2>
        <p>我们收集您主动提供给我们的个人信息，包括：</p>
        <ul className="list-disc list-inside pl-4 gap-2">
          <li>
            <strong>基本信息：</strong>如姓名、电子邮箱地址、密码等。
          </li>
          <li>
            <strong>用户内容：</strong>
            您在使用我们服务时收集的任何个人信息，包括在输入、文件上传、反馈或输出中提供的信息。
          </li>
          <li>
            <strong>通信内容：</strong>
            我们之间交换的任何通信，包括聊天机器人界面通信、调查回复或反馈。
          </li>
        </ul>
        <p>我们还会自动收集以下信息：</p>
        <ul className="list-disc list-inside pl-4 gap-2">
          <li>
            <strong>应用程序、浏览器和设备信息：</strong>
            如设备类型、操作系统、浏览器信息、IP地址及其他设备特征。
          </li>
          <li>
            <strong>服务使用数据：</strong>包括活动信息、诊断和故障排除信息。
          </li>
          <li>
            <strong>来自Cookie和类似技术的信息。</strong>
          </li>
        </ul>
        <p>
          个人信息不包括已去标识化、匿名化或聚合的信息。当数据被去标识化或匿名化后，我们维持其该状态，且不试图重新识别这些信息。
        </p>

        <h2 className="text-lg font-bold my-2">2. 我们如何使用您的信息</h2>
        <p>
          我们主要为以下目的使用您的个人信息：提供服务、个性化体验、运营管理、改进服务、创建和开发新功能，同时确保您获得安全、流畅、高效和定制化的体验。此外，我们也基于法律合规需求和防损目的使用您的信息。
        </p>
        <p>请放心，您的账户密码仅用于创建和维护您的账户及为您提供服务。</p>
        <p>
          我们使用您的基本信息创建和维护您的账户，这是履行我们与您合同的必要条件。为向您提供服务，我们使用您的基本信息、通信内容、应用程序信息、浏览器和设备信息、服务使用数据以及您提交的其他信息，这也是履行合同所必需的。
        </p>
        <p>
          在提供客户支持时，我们使用您的基本信息、通信内容、服务使用数据（包括位置信息）、应用程序信息、浏览器和设备信息。我们依赖合法利益处理这些信息，特别是为确保您能最佳使用服务的利益。在欧洲经济区和英国，您有权反对并要求限制此类处理（即"合法利益"处理）。
        </p>
        <p>
          在发送与服务相关的通信时，我们使用您的基本信息、通信内容、应用程序信息、浏览器和设备信息、服务使用数据以及您提交的其他信息，这对于履行合同是必要的，同时也基于确保您能最佳使用服务的合法利益。
        </p>
        <p>
          为保障服务的安全、完整和受保护，我们处理您的基本信息、通信内容、应用程序信息、浏览器和设备信息、服务使用数据以及您提交的其他信息，这基于维护服务有效运营和交付的合法利益。
        </p>
        <p>
          为遵守法律和监管义务，我们使用您的基本信息、通信内容、应用程序信息、浏览器和设备信息、服务使用数据以及您提交的其他信息，这基于遵守我们运营所在司法管辖区法律、响应请求及履行企业责任的合法利益。
        </p>
        <p>
          为定制您的服务体验并改进我们的服务，我们处理您的基本信息、通信内容、应用程序信息、浏览器和设备信息及服务使用数据，这基于了解用户如何与服务互动以定制和改进产品，并确保报告准确可靠的合法利益。
        </p>
        <p>
          为促进服务、网络、用户、员工和公众的安全与诚信，我们使用您的基本信息、通信内容、应用程序信息、浏览器和设备信息及服务使用数据，这基于防止欺诈、未经授权使用、违规行为，保护各方安全，解决争议，验证账户，打击有害行为及防止损害的合法利益。
        </p>
        <p>
          为研究和创新目的，我们使用您的基本信息、通信内容和服务使用数据，这基于通过用户反馈改进和迭代服务的合法利益。
        </p>

        <h2 className="text-lg font-bold my-2">
          3. 我们如何及为何共享您的信息
        </h2>
        <p>
          我们承诺不为定向广告目的出售或与第三方共享您的个人信息。此外，我们从未为定向广告目的出售或共享16岁以下个人的个人信息。
        </p>
        <p>为提供服务，我们可能需要与以下几类第三方共享必要信息：</p>
        <ol className="list-decimal list-inside pl-4 gap-2">
          <li>
            <strong>服务支持方：</strong>{' '}
            向协助提供服务的第三方服务提供商披露必要的个人信息。我们的服务支持方包括
            Amplitude，一个帮助我们了解用户如何与服务互动、优化用户体验和改进产品功能的数据分析平台。Amplitude
            不存储您提供的任何聊天数据；它只存储事件数据，例如"点击新任务"的次数。
          </li>
          <li>
            <strong>用户主动分享：</strong>
            当您使用如对话链接等主动分享功能时，信息接收方将取决于您选择与谁分享。
          </li>
          <li>
            <strong>法律合规场景：</strong>
            在以下情况与顾问、监管机构或政府机构共享信息：
            <ul className="list-disc list-inside pl-4 gap-2">
              <li>响应法律和监管要求、法院命令或政府请求</li>
              <li>履行法定义务和监管要求</li>
              <li>调查和预防欺诈及安全问题</li>
              <li>保护各方的权利和人身安全</li>
            </ul>
          </li>
          <li>
            <strong>企业账户关联：</strong>
            若您使用企业邮箱注册，我们可能与该组织共享账户存在及基本信息（如邮箱地址），以便企业管理员管理账户权限。
          </li>
          <li>
            <strong>集团内部协作：</strong>
            基于服务效率要求，信息可能在关联公司或集团成员之间共享。
          </li>
          <li>
            <strong>资产交易场景：</strong>
            在公司合并、收购、重组、破产或其他控制权变更期间，您的信息可能作为交易资产转移。
          </li>
          <li>
            <strong>应您要求披露：</strong> 当您明确指示或合同规定披露时。
          </li>
        </ol>
        <p>
          <strong>请注意：</strong>
          我们的服务可能包含指向第三方网站（如社交媒体）的链接，其隐私政策独立于我们。请知悉，当您离开
          <strong className="text-primary"> turboai </strong>
          服务访问其他网站或使用其他服务时，即使是通过
          <strong className="text-primary"> turboai </strong>
          提供的链接访问，我们无法也无义务保护您在这些第三方平台上提供的个人信息。
        </p>

        <h2 className="text-lg font-bold my-2">4. 安全性</h2>
        <p>
          我们已实施一系列合理的技术、管理和组织措施，旨在全面保护您的个人信息安全。这些保护措施覆盖线上和线下环境，旨在防止您的个人信息丢失、滥用、未经授权的访问、披露、更改或销毁。
        </p>
        <p>
          然而，我们必须坦诚指出，在当今数字世界中，没有任何安全系统能提供100%的绝对保护。因此，在使用我们的服务时，您需理解并接受此现实：尽管我们尽最大努力保护您的信息，但使用我们服务相关的风险最终须由您个人承担。
        </p>

        <h2 className="text-lg font-bold my-2">5. 数据保留</h2>
        <p>
          我们仅在为提供服务、履行法律义务或保护相关权利所必需的时间内保留您的个人信息。我们考虑信息收集时间、服务需求、法律要求和安全因素来确定保留期限。当信息不再需要或您请求删除时，我们将及时处理。我们致力于在满足业务需求的同时，尊重您对个人数据的控制权。
        </p>

        <h2 className="text-lg font-bold my-2">6. 儿童个人信息</h2>
        <p>
          我们的服务专为成人设计，不针对儿童。我们不会故意征求或收集儿童的个人信息。根据我们的服务条款，所有用户必须年满18岁才能使用我们的服务。若您发现我们未经监护人同意收集了未成年人的个人信息，请立即联系我们，我们将及时删除相关数据。
        </p>

        <h2 className="text-lg font-bold my-2">7. 国际数据传输</h2>
        <p>
          为支持全球业务运营，我们及我们的合作伙伴可能在全球范围内（包括在欧盟、英国和美国）传输、存储和处理您的个人信息。对于欧盟、瑞士或英国的居民，我们严格遵守合法的数据传输机制，如欧盟委员会的标准合同条款及相关地方法规（如英国的国际数据传输附录），确保您的个人数据在跨境传输期间获得适当保护。
        </p>

        <h2 className="text-lg font-bold my-2">8. 您如何行使个人权利</h2>
        <p>
          根据您所在地区的法律，您可能拥有以下与个人信息相关的权利。即使地方法律未明确规定这些权利，我们也可能酌情为您提供这些选择。
        </p>
        <ul className="list-disc list-inside pl-4 gap-2">
          <li>
            <strong>访问信息和数据可携带权：</strong>
            您有权获取我们持有的您的个人信息副本，了解我们如何使用和披露您的信息，以及我们过去如何处理您的数据。您也可请求我们以标准化、常用且机器可读的格式提供特定信息，并将其传输给您或您指定的第三方。
          </li>
          <li>
            <strong>删除权：</strong>
            您可请求我们删除您的个人信息。账户终止后，我们将根据数据保留政策处理或删除您的相关信息。
          </li>
          <li>
            <strong>更正权：</strong>
            您可请求我们更新或更正您认为不完整或不准确的个人信息。
          </li>
          <li>
            <strong>限制处理和反对权：</strong>
            您可基于合法利益、公共利益或直接营销目的，限制或反对我们使用或传输您的个人信息。但在法律允许或要求的情况下，我们可能继续处理您的信息。
          </li>
          <li>
            <strong>撤回同意权：</strong>
            当我们基于您的同意处理信息时，您可随时撤回该同意。这不会影响您撤回前我们处理信息合法性。
          </li>
          <li>
            <strong>上诉权：</strong>{' '}
            若我们拒绝您的请求，您可对我们的决定提出上诉。
          </li>
          <li>
            <strong>投诉权：</strong>
            您有权向当地数据保护机构提出投诉。
          </li>
        </ul>
        <p>
          您可通过发送电子邮件至我们的隐私邮箱提交请求。我们不会因您行使合法权利而歧视您。为保护您的隐私和安全，我们可能在处理您的请求前验证您的身份，包括要求提供额外信息。若我们无法验证您的身份，可能会拒绝您的请求。
        </p>
        <p>
          根据某些美国隐私法，您可指定授权代理人代表您提出请求。我们将要求代理人提供您的授权证明，并可能需要您直接确认身份。
        </p>
        <p>请注意，上述权利并非绝对，可能仅适用于特定情况或可被合理拒绝。</p>
        <h2 className="text-lg font-bold my-2">9. 联系我们</h2>
        <p>
          若您对本隐私政策有任何疑问或疑虑，或有投诉，请通过{' '}
          <a href="mailto:turboai@gmail.com" className="text-primary">
            turboai@gmail.com
          </a>{' '}
          联系我们。
        </p>

        <h2 className="text-lg font-bold my-2">10. 本隐私政策的变更</h2>
        <p>
          为持续优化服务质量，我们可能定期更新本隐私政策。所有政策变更将在此页面发布，重大变更将根据法律要求以合理方式通知您。您可随时查看页面顶部的日期以了解政策最后更新时间。我们鼓励您定期审阅本政策，以随时了解我们如何保护您的个人信息。
        </p>
      </div>
    </div>
  );
}
